/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (vēl +%2$d)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Neizdevās tiplatspiest \"%1$@\" no \"%2$@\" arhīvs: %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Neizdevās tiplatspiest resursu dakšas, lai \"%1$@\" no \"%2$@\" arhīvs:\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Noklusētais kodējums";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Noteikt automātiski";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Atpakot";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Atpakot arhīvu";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Atpakoju “%@”";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Sagatavojos atpakot “%@”";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Atlasīt";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Atlasīt datnes atpakošanai";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "\"%@\" saturu nav iespējams ekstrahēt ar The Unarchiver.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Notikusi kļūda, iegūšana faila \"%1$@\" saturu: %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Notikusi kļūda, nolasot faila \"%1$@\" saturu: %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Atarhivēt";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Lūdzu, sniedziet arhīva paroli, lai atvērtu \"%@\".";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Kurā mapē The Unarchiver vajadzētu atpakot arhīvus?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Vienmēr iegūt tajā pašā mapē, vai ļaujiet uzdot jums izvēlēties galamērķi katru reizi app.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Jautāt katru reizi";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Atpakot turpat, kur atrodas arhīvs";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver, nepieciešama jūsu atļauja, lai izvērstos failus saglabāt izvēlētajā mapē. Noklikšķiniet uz \"Legūt\", apstiprināt šo darbību.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver nepieciešama jūsu atļauja, lai meklētu citur šajā vietā izvēlētajā arhīvā. Noklikšķiniet uz \"Meklēt\", lai apstiprinātu šo darbību.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Meklēt";

/* Check for updates menu item */
"Check for Updates…" = "Meklēt atjauninājumus...";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "Arhīvs ir nepilnīgs";
"Opening file failed" = "Datni nav iespējams atvērt";
"Missing or wrong password" = "Norādītā parole nav derīga";
"Wrong checksum" = "Arhīvs ir bojāts";
"Could not create directory" = "Nevarēju izveidot mapi";

/* Uncommon or unused errors */
"Unknown error" = "Nezināma kļūda";
"Failed to write to file" = "Neizdavās ierakstīt datni";
"Function called with illegal parameters" = "Funkcijas izsaukums ar neatļautiem parametriem";
"Not enough memory available" = "Nepietiek atmiņas";
"Data is corrupted" = "Bojāti dati";
"File is not fully supported" = "Datne netiek pilnībā atbalstīta";
"Required resource missing" = "Trūkst nepieciešamo resursu";
"Error on decrunching" = "Skaitļošanas kļūda";
"Unknown file type" = "Nezināms datnes tips";
"File, disk has been skipped" = "Datne, disks ir izlaisti";
"User cancelled extraction" = "Lietotājs apturējis atpakošanu";
"File already exists" = "Norādītā datne jau eksistē";
"Verify failed (disk hook)" = "Kļūda pārbaudot (diskam)";
"Wrong drive geometry" = "Neatbilstoša diska ģeometrija";
"Unknown data format" = "Nezināms datu formāts";
"Source contains no files" = "Norādītais arhīvs nesatur datnes";
"Unknown filesystem" = "Nezināma failu sistēma";
"Name of file exists as directory" = "Eksistē mape ar norādīto datnes vārdu";
"Buffer was too short" = "Pārāk īss buferis";
"Text encoding was defective" = "Defektīvs teksta kodējums";
"Could not create symlink" = "Nevarēja izveidot simbolsaiti";

"AlertTitle_SetFileTypeAssociationAppStore" = "Apsveriet iestatījumu The Unarchiver kā noklusējuma lietotni atlasītajiem failu tipiem.";
"AlertDescription_SetFileTypeAssociationAppStore" = "Konteksta izvēlnē Fails noklikšķiniet uz \"Iegūt informāciju\" un izvēlieties The Unarchiver \"Atvērt ar:\" sarakstu. Noklikšķiniet uz \"Mainīt visus…\" tas jāpiemēro līdzīgi arhīviem.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "Iestatīt citu app atlasītajiem failu tipiem kā noklusējuma app, ja vēlaties.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Konteksta izvēlnē Fails noklikšķiniet uz \"Iegūt informāciju\" un izvēlieties vēlamo app \"Atvērt ar:\" sarakstu. Noklikšķiniet uz \"Mainīt visus…\" tas jāpiemēro līdzīgi arhīviem.";

/* About window */
"Standalone" = "Savrupa";

/* Extracted view */
"extracted" = "ekstrahē";
